import React, { useState } from "react";
import "./App.css";

function App() {
  const [isOpen, setIsOpen] = useState(false);

  return (
    <div className="container">
      <h1>💖 Happy Valentine 💖</h1>

      <div className={`envelope ${isOpen ? "open" : ""}`}>
        <div className="flap"></div>
        <div className="letter">
          <p>-</p>
          <p>Happy Valentine นะค้าบ ปีนี้มีเรื่องราวมากมายอยากบอกเธอนะแต่คงพิมพ์ได้ไม่หมดงั้นเริ่มจากต้นปีแล้วกันนะค้าบ ตั้งแต่ต้นปีแล้วเค้าเริ่มรู้สึกรักเธอมากขึ้นเรื่อยๆ จนเค้าเริ่มเปิดใจกับเธอได้จริงๆแล้วเค้าอยากบอกเธอในวันนี้มากว่าเค้าขอโทษสำหรับ4ปีก่อนและหลังจากนี้เค้าจะดูแลเธอให้ดีให้สมกับที่เค้ารักเธอจากหัวใจของเค้าแล้วจริงๆและที่เธออยู่กับเค้ามา
            แต่ก็ไม่คิดว่า จะเกิด เหตุการณ์แบบตอนนี้ขึ้นมาก่อนตอนนี้ เค้าคงได้แต่พิมพ์ขอโทษเธอโดยที่ตอนนี้เค้าไม่มีสิทธ์ได้ดูแลเธอในสถานะ แฟนแล้ว😢 ตลอดระยะเวลา 4ปี ที่เค้ารู้สึกช้าเกินไปและทำให้เธอต้องอดทนมาตลอด 
            ทั้งเสียใจทั้งร้องไห้ เค้าอยากสารภาพกับเธออยากให้เธอเข้าใจว่าทำไมตอนแรกเค้าถึงได้ทำอย่างนั้นกับเธอที่ตอนแรกๆเค้าทั้งทำผิดต่อเธอหลายๆอย่างและยังไม่ใส่ใจเธอ ตอนนั้นเค้ายังไม่รู้ใจตัวเองจริงๆ แต่ถามว่ารักเธอไหมรักนะ แต่ก็ยังกลัวที่จะเปิดใจ
            มันเลยทำให้เค้าแสดงออกต่อเธอแบบนั้นไปในช่วงปีแรกๆ ในช่วงนั้นเธอที่เปิดใจให้เค้าทุมเทให้เค้าก่อน แบบสุดตัวเลยได้รับแต่ความรู้สึกแย่ๆ
            แต่มันก็ไม่ใช้ข้ออ้างที่เค้าจะอ้างกับเธอหรอกนะเค้าอยากให้เธอรู้ถึงตอนแรกเค้าจะยังไม่รู้ถึงใจตัวเองและทำผิดกับเธอมากมาย แต่ตอนนี้เค้ารู้แล้วว่าเค้ารู้สึกยังไงกับเธอ ในสิ่งที่เค้าทำกับเธอ เค้าอยากขอโทษเธอมาตลอด ใน 4 ปีนี้เธอให้อภัยเค้ามามากแล้วจริงๆทั้งโอกาสต่างๆ
            ครั้งนี้เค้าจะไม่ขอโอกาสง่ายๆ แบบตอนนั้นอีกแล้ว ถึงตอนนี้เค้าอาจจะไม่ได้อยู่ในสถานะ แฟน ของเธอแล้ว แต่เค้าจะพยายาม ทำให้เธอมอบโอกาสกลับมาคบกับเค้าใหม่ให้ได้🥰 ถึงตอนนั้นเค้าอยากขอโทษ
            เธออีกครั้งต่อหน้าเธอในสถานะที่ เค้าเป็นแฟน เธออีกครั้ง😊 
          </p>
          <p> 
            ถ้าเธออ่านจนมาถึงตรงนี้หลังจากนี้ก็จะเป็นความคิดถึงและสิ่งที่เค้าอยากปรับปรุงต่อเธอรวมถึงอาจจะมีน้อยใจนิดหน่อยด้วยนะงับ🥰 ถ้าเรายังคบกันอยู่ Valentine ปีนี้ก็คงดีเค้าอยากทำให้ปีนี้เป็นปีที่พิเศษที่สุดตั้งแต่ต้นปีจนหมดปีเลยแต่ตอนนี้คงต้องง้อเธอก่อน😊 เค้าจะพยายามทำให้ดีที่สุด ในช่วงที่ตอนนี้เธอยังอยู่กับเค้านะ เค้าไม่รู้ว่าเธอจะ เจอใครที่ดีกว่า
            ก่อนหรือป่าว แต่เค้าจะเป็นคนที่ดีกว่าคนนั้น ให้เธอ💖  เค้าคิดถึงเธอมากๆนะ อยากเจอเธอในเวอร์ชั่นแฟน ขี้อ้อน เอาใจใส่ อยากกอดเธอด้วย อยากให้เธอลูบหัว 😢 พอพิมพ์แล้วก็คิดถึงทุกสิ่งทุกอย่างที่เธอเคยทำให้ จนตอนนี้ที่เค้าพิมพ์อยู่ก็เริ่มมีน้ำตาแล้วแหละ
            คิดถึงเธอมากๆๆเลยนะ แต่ตอนนี้คงยังเจอไม่ได้หรอกใช่ไหม แต่ไม่เป็นไร เค้าจะรอนะ ถึงจะอยากอ้อนเธอมากๆแล้วก็ตามทีแต่เค้าจะไม่ขอโอกาสง่ายๆกับเธออีกแล้วเค้าจะรอเธอนะ🥰 อย่าพึ่งไปมีใครใหม่เลยนะ ถ้าจะมีใหม่ขอเป็นเค้าในแบบ
            ที่เป็นคนใหม่ของเธอได้ไหมงับ💖
          </p>
          <p>ขอบคุณสำหรับ 4 ปี ที่พยายามเพื่อเค้า ตอนนี้เค้าจะพยายามเพื่อเธอบ้างค่อยมองเค้าด้วยนะ 😊</p>
          <p>แม้ว่าสุดท้าย แล้วเธออาจจะไม่ได้กลับมา แต่เค้าก็จะไม่เสียใจและไม่เสียดายเวลาในตอนนี้</p>
          <p>พัฒน์ ❤️ มีนนะ Happy Valentine Day💖 นะค้าบขอให้เธอมีความสุข ตลอดปีนะค้าบ😘</p>
        </div>
      </div>

      <div className="buttons">
        <button className="open-btn" onClick={() => setIsOpen(true)}>OPEN</button>
        <button className="close-btn" onClick={() => setIsOpen(false)}>CLOSE</button>
      </div>
    </div>
  );
}

export default App;
